# if,else คืออะไร ???????
x = 3 # x เป็นจํานวนเต็มเท่ากับ 3
# == เท่ากับ ข้อมูลที่เหมือนกัน และชนิดเดียวกัน
if x == 3: # X = 3 จริงไหม ถ้าจริง จะทํางานข้างล่าง โดย บรรทัดต้องห้ามตรงกัน เพื่อระบุขอบเขต
   print("x = 3 is true") 
if str(x) == "3":
   print("x is trueeeee")
else: # ถ้าไม่ตรงกับเงื่อนไข ข้างบน ทําข้างล่าง
  print("x = 3 false")
"""
เครื่องหมายของเงื่อนไข
== เท่ากับ
!= ไม่เท่ากับ
> มากกว่า
< น้อยกว่า
>= มากกว่า หรือ  เท่ากับ
<= น้อยกว่า หรือ เท่ากับ
and และ เช่น if x == 3 and x > 2 ถ้า x เท่ากับ 3 และ x > 2
or หรือ เช่น if x == 3 or x > 5 ถ้า x เท่ากับ 3 หรือ x มากกว่า 5
"""
   
  
